cases/ansys_verification/VMFL046/INVISCID/case/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-9; relTol 0.01; }
    "(U|e)" { solver PBiCGStab; preconditioner DILU; tolerance 1e-9; relTol 0.1; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pMinFactor      0.1;
    pMaxFactor      3.0;
    transonic       yes;
    consistent      yes;
    // NO residualControl: convergence is judged by the GATE-QUANTITY PLATEAU on M(0.9)
    // (charter v1.17/v1.18 §22.5), not by a residual floor -- the steady-shock limit cycle
    // floors residuals ~1e-4 (this lab's finding), so a residual floor is the wrong
    // criterion. The run goes to endTime; the comparator judges the plateau over W=500.
}
relaxationFactors
{
    fields    { p 1; }
    equations { p 1; U 0.3; e 0.5; }
}
